# Переиндексация

In [2]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [3]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [4]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [5]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [6]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
 index=['a', 'c', 'd'],
 columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [7]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [8]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

KeyError: "['b'] not in index"

# Задание 1

index -	Новая последовательность для использования в качестве индекса. Может быть экземпляром Index или любой последовательности Python
method - Метод интерполяции (заполнения): ffil (forward-fill) — прямое заполнение, bfill (backward-fill) — обратное заполнение
fill_value - Подставляется это значения при заполнении пропущенных данных, которые появляются при переиндексации
limit -	При заполнении задает максимальный размер шага (по количеству элементов) заполнения
tolerance -	При заполнении задает максимальный размер шага (в абсолютном числовом расстоянии) для заполнения неточных совпадений
level -	Сопоставляет простой Index на уровне MultiIndex; в противном случае выбирает подмножество
copy -	Если True, всегда копирует данные, даже если новый индекс эквивалентен старому; если False не копирует данные, если индексы эквивалентны

In [29]:
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror'])
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [32]:
index = ['Safari', 'Iceweasel', 'Comodo Dragon', 'IE10',
             'Chrome']
df1 = df.reindex(index = index, fill_value = "miss")
df1

              http_status response_time
Safari                404          0.07
Iceweasel            miss          miss
Comodo Dragon        miss          miss
IE10                  404          0.08
Chrome                200          0.02

In [18]:
my_obj = pd.Series(['blue', 'purple', 'yellow', 'green'], index=[1, 2, 3, 4])
my_obj

1      blue
2    purple
3    yellow
4     green
dtype: object

In [21]:
my_obj.reindex(index = [0, 1, 2, 3, 4])

0       NaN
1      blue
2    purple
3    yellow
4     green
dtype: object

In [22]:
my_obj.reindex(index = [0, 1, 2, 3, 4], method = 'bfill')

0      blue
1      blue
2    purple
3    yellow
4     green
dtype: object

In [44]:
my_obj4 = pd.Series(['black', 'blue', 'purple', 'yellow', 'green'], index=[0, 1, 2, 3, 4])
my_obj4

0     black
1      blue
2    purple
3    yellow
4     green
dtype: object

In [83]:
my_obj4.reindex(index=[0, 1, 2, 3, 4, 5, 6, 7, 8], limit = 1, method = 'ffill', tolerance = 3)

0     black
1      blue
2    purple
3    yellow
4     green
5     green
6       NaN
7       NaN
8       NaN
dtype: object

In [92]:
df = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror'])
df

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [95]:
df.reindex(columns = ['response_time', 'http_status'], copy = True)

           response_time  http_status
Firefox             0.04          200
Chrome              0.02          200
Safari              0.07          404
IE10                0.08          404
Konqueror           1.00          301

# Удаление элементов из оси

In [12]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [13]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [14]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [15]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [16]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [18]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [19]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

# Доступ по индексу, выборка и фильтрация

In [20]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [21]:
obj['b']

1.0

In [22]:
obj[1]

1.0

In [23]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [24]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [25]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [26]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [27]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [28]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [19]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
 index=['Ohio', 'Colorado', 'Utah', 'New York'],
 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [31]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [32]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [33]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [35]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# Выборка с помощью loc и iloc

In [36]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [37]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [38]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [39]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [40]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [22]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

# Задание 2

In [3]:
data1 = pd.DataFrame({'http_status': [200, 200, 404, 404, 301],
                  'response_time': [0.04, 0.02, 0.07, 0.08, 1.0]},
                  index=['Firefox', 'Chrome', 'Safari', 'IE10', 'Konqueror'])
data1

           http_status  response_time
Firefox            200           0.04
Chrome             200           0.02
Safari             404           0.07
IE10               404           0.08
Konqueror          301           1.00

In [6]:
data1['http_status']

Firefox      200
Chrome       200
Safari       404
IE10         404
Konqueror    301
Name: http_status, dtype: int64

In [10]:
data1.loc['Safari', ['http_status']]

http_status    404.0
Name: Safari, dtype: float64

In [18]:
data1.loc['Safari':'IE10']

        http_status  response_time
Safari          404           0.07
IE10            404           0.08

In [24]:
data1.loc['Safari', 'response_time']

0.07

In [25]:
 data1.iloc[1, 1]

0.02

In [32]:
data1.iloc[:4, :1]

         http_status
Firefox          200
Chrome           200
Safari           404
IE10             404

In [33]:
data1.at['Firefox', 'http_status']

200

In [35]:
data1.iat[4, 1]

1.0

In [38]:
data1.reindex(columns=['http_status', 'response_time_new'])

           http_status  response_time_new
Firefox            200                NaN
Chrome             200                NaN
Safari             404                NaN
IE10               404                NaN
Konqueror          301                NaN

get_value - Deprecated since version 0.21.0: Use .at[] or .iat[] accessors instead.